#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aci_tenant.git will be created
  + resource "aci_tenant" "git" {
      + annotation                    = "orchestrator:terraform"
      + description                   = (known after apply)
      + id                            = (known after apply)
      + name                          = "git"
      + name_alias                    = (known after apply)
      + relation_fv_rs_tenant_mon_pol = (known after apply)
    }

  # aci_vrf.git will be created
  + resource "aci_vrf" "git" {
      + annotation                              = "orchestrator:terraform"
      + bd_enforced_enable                      = (known after apply)
      + description                             = (known after apply)
      + id                                      = (known after apply)
      + ip_data_plane_learning                  = (known after apply)
      + knw_mcast_act                           = (known after apply)
      + name                                    = "git_vrf"
      + name_alias                              = (known after apply)
      + pc_enf_dir                              = (known after apply)
      + pc_enf_pref                             = (known after apply)
      + relation_fv_rs_bgp_ctx_pol              = (known after apply)
      + relation_fv_rs_ctx_to_ep_ret            = (known after apply)
      + relation_fv_rs_ctx_to_ext_route_tag_pol = (known after apply)
      + relation_fv_rs_ospf_ctx_pol             = (known after apply)
      + relation_fv_rs_vrf_validation_pol       = (known after apply)
      + tenant_dn                               = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kozhabergenova, Action: `pull_request`*